In [5]:
import numpy as np
import pandas as pd

# Exercício 1

In [30]:
data = pd.DataFrame({
    'Name': [
        'João das Neves',
        'Daniela Targaryen',
        'Luke Caminhante do Ceu',
        'Carolina Coralina',
        np.nan
    ],
    'ID': [
        1111,
        np.nan,
        3333,
        4444,
        5555
    ],
    'Type': [
        np.nan,
        'Doctorate',
        np.nan,
        'MSc',
        'MSc'
    ],
    'Mean Grade': [
        8.0,
        np.nan,
        8.0,
        9.8,
        5.0
    ]
})

data

                     Name      ID       Type  Mean Grade
0          João das Neves  1111.0        NaN         8.0
1       Daniela Targaryen     NaN  Doctorate         NaN
2  Luke Caminhante do Ceu  3333.0        NaN         8.0
3       Carolina Coralina  4444.0        MSc         9.8
4                     NaN  5555.0        MSc         5.0

In [17]:
data.dropna(axis=0, how='any', subset=['ID', 'Type', 'Mean Grade'])
# Errado pois não remove os valores vazios da coluna 'Name'

                Name      ID Type  Mean Grade
3  Carolina Coralina  4444.0  MSc         9.8
4                NaN  5555.0  MSc         5.0

In [19]:
data.dropna(axis=1, how='all')
# Errado pois remove colunas que tenham todos registros vazios

                     Name      ID       Type  Mean Grade
0          João das Neves  1111.0        NaN         8.0
1       Daniela Targaryen     NaN  Doctorate         NaN
2  Luke Caminhante do Ceu  3333.0        NaN         8.0
3       Carolina Coralina  4444.0        MSc         9.8
4                     NaN  5555.0        MSc         5.0

In [26]:
data.dropna(how='all', subset=['ID', 'Type', 'Mean Grade'])
# Errado pois não considera todas colunas e porque só remove registros que tenham todos valores vazios

                     Name      ID       Type  Mean Grade
0          João das Neves  1111.0        NaN         8.0
1       Daniela Targaryen     NaN  Doctorate         NaN
2  Luke Caminhante do Ceu  3333.0        NaN         8.0
3       Carolina Coralina  4444.0        MSc         9.8
4                     NaN  5555.0        MSc         5.0

In [29]:
data.dropna()
# Correto

                Name      ID Type  Mean Grade
3  Carolina Coralina  4444.0  MSc         9.8

In [31]:
data.dropna(axis=1, subset=['ID', 'Type', 'Mean Grade'])
# Tudo errado

KeyError: ['ID', 'Type', 'Mean Grade']

# Exercício 2

In [33]:
data = pd.DataFrame({
    'Nome': ['Titanic', 'O Poderoso Chefão', 'Avatar', 'Cinderela Baiana', 'Titanic'],
    'Genero': ['Romance', 'Drama', 'Aventura', 'Terror', 'Drama'],
    'Nota': [4.6, 4.9, 4.0, 5.0, 4.9]
})

data

                Nome    Genero  Nota
0            Titanic   Romance   4.6
1  O Poderoso Chefão     Drama   4.9
2             Avatar  Aventura   4.0
3   Cinderela Baiana    Terror   5.0
4            Titanic     Drama   4.9

In [35]:
data.drop_duplicates(keep='last')
# Errado pois remove apenas registros com todas colunas iguais

                Nome    Genero  Nota
0            Titanic   Romance   4.6
1  O Poderoso Chefão     Drama   4.9
2             Avatar  Aventura   4.0
3   Cinderela Baiana    Terror   5.0
4            Titanic     Drama   4.9

In [36]:
data.drop(data[data.duplicated(subset='Nome', keep='last')].index)
# Correto

                Nome    Genero  Nota
1  O Poderoso Chefão     Drama   4.9
2             Avatar  Aventura   4.0
3   Cinderela Baiana    Terror   5.0
4            Titanic     Drama   4.9

In [42]:
data.drop_duplicates(by='Nome', keep='last')
# Sintaxe errada

TypeError: drop_duplicates() got an unexpected keyword argument 'by'

In [45]:
del data.duplicated(subset='Nome', keep='last')
# 'del' é usado para remover objetos, e não funções

SyntaxError: cannot delete function call (<ipython-input-45-b491102ca61d>, line 1)

In [47]:
data.drop_duplicates(subset=['Nome'], keep='last')
# Correto

                Nome    Genero  Nota
1  O Poderoso Chefão     Drama   4.9
2             Avatar  Aventura   4.0
3   Cinderela Baiana    Terror   5.0
4            Titanic     Drama   4.9

In [53]:
data.drop_duplicates(subset='Nome', last=True)
# Sintaxe incorreta

TypeError: drop_duplicates() got an unexpected keyword argument 'last'

In [56]:
data

                Nome    Genero  Nota
0            Titanic   Romance   4.6
1  O Poderoso Chefão     Drama   4.9
2             Avatar  Aventura   4.0
3   Cinderela Baiana    Terror   5.0
4            Titanic     Drama   4.9